Artshare/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 2], ["artwork_id", 1], ["created_at", "2023-01-12 23:26:30.596963"], ["updated_at", "2023-01-12 23:26:30.596963"]]
---
    def create
        # debugger
        @artworkshare = ArtworkShare.new(artwork_share_params)
        if @artworkshare.save

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]
---
    def destroy
        @artworkshare = ArtworkShare.find(params[:id])
        @artworkshare.destroy