Artshare/app/controllers/artworks_controller.rb

    def create
        # debugger
        @artwork = Artwork.new(artwork_params)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Big Black Painting"], ["image_url", "0008"], ["artist_id", 2], ["created_at", "2023-01-12 23:05:03.263077"], ["updated_at", "2023-01-12 23:05:03.263077"]]

    def show
        @artwork = Artwork.find_by(id: params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE (artist_id = User.find(params[:id]))