Artshare/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "A"], ["email", "A@gmail.com"], ["created_at", "2023-01-12 00:24:42.679266"], ["updated_at", "2023-01-12 00:24:42.679266"]]

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "RandomName"], ["updated_at", "2023-01-12 00:49:28.996990"], ["id", 2]]