Artshare/app/models/artwork.rb

    def self.artworks_for_user_id(user_id)

        # # Rails 1 method
        # owned_artworks = Artwork.where(artist_id: user_id)
        # shared_artworks = Artwork.joins(:shares).where('artworks.id = artwork_shares.artwork_id AND artwork_shares.viewer_id = ?', user_id)

        owned_artworks = User.find(user_id).artworks
---
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.id = artwork_shares.artwork_id AND artwork_shares.viewer_id = '3')
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]